webstore/app/Controllers/AddProducts.php

INSERT INTO `products` (`name`, `price`, `description`) VALUES ('Wireless Charger', 50, 'Sample Wireless Charger')
---
    public function save()
    {

        $session = session();

        //get product
        $addedItem = $_POST['iteminput'];


        //Smartphone
        if ($addedItem == "smartphone"){

            //include helper form
            helper(['form']);

            //set rules validation form
            $rules = [
                'iteminput'          => 'required|min_length[3]|max_length[20]|is_unique[products.name]',
            ];

            if($this->validate($rules)){
                $model = new ProductsModel();

                $data = [
                    'prodID'        => 1,
                    'name'          => "Smartphone",
                    'price'         => 500.00,
                    'description'   => "Sample smartphone.",
                ];

                $model->save($data);