webstore/app/Controllers/Cart.php

INSERT INTO `transactions` (`datepurchased`, `subtotal`, `itemspurchased`, `user`) VALUES ('2022-05-04 18:29:06', '907.5', ', laptop, , , headphones, , bluetoothspeaker', 'tester')
---
    public function complete()
    {
        $session = session();

        $currentUser = $session->get('user_name');

        $model = new TransactionsModel();

        $itemspurchased = " ";

        date_default_timezone_set('America/Chicago');

        $date = date('Y-m-d H:i:s');

        $total = $_POST['totaledInput'];

        $itemspurchased = $_SESSION['itemsCombined'];

        $data = [
            'datepurchased'     => $date,
            'subtotal'          => $total,
            'itemspurchased'    => $itemspurchased,
            'user'              => $currentUser,
        ];

        $model->save($data);